In [1]:
import pandas as pd

# pivot_table()

In [ ]:
# read and show dataset
sales = pd.read_excel('supermarket_sales.xlsx')
sales

In [6]:
# make a pivot table and add an aggregate function
sales.pivot_table(index="Gender", aggfunc="sum")

,Quantity,Rating,Tax 5%,Total,Unit price,cogs,gross income,gross margin percentage
Gender,,,,,,,,
Female,2869,3489.2,7994.425,167882.925,27687.24,159888.50,7994.425,2385.714286
Male,2641,3483.5,7384.944,155083.824,27984.89,147698.88,7384.944,2376.190476

In [7]:
# make a pivot table and add an aggregate function and select only two columns
sales.pivot_table(index="Gender", values=["Quantity", "Total"], aggfunc="sum")

        Quantity       Total
Gender
Female      2869  167882.925
Male        2641  155083.824

In [8]:
# make a pivot table and add an aggregate function and select only two columns
sales.pivot_table(index="Gender", columns="Product line", values="Total", aggfunc="sum")

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Gender,,,,,,
Female,27102.0225,30437.400,33170.9175,18560.9865,30036.8775,28574.7210
Male,27235.5090,23868.495,22973.9265,30632.7525,23825.0355,26548.1055